[Build State]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","bid{}","bugtraq","canvas_package","cert","cert-cc","cert{}","cpe","cpe{}","cve","cve{}","cvss","cvss3_base_score","cvss3_temporal_score","cvss3_temporal_vector","cvss3_vector","cvss_base_score","cvss_temporal_score","cvss_temporal_vector","cvss_vector","cwe","cwe{}","default_account","description","eventtype","exploit_available","exploit_framework_canvas","exploit_framework_core","exploit_framework_metasploit","exploitability_ease","exploited_by_malware","exploited_by_nessus","family_name","fedora","fname","glsa","id","index","linecount","mdksa","metasploit_name","msft","msft{}","mskb","osvdb","osvdb{}","patch_publication_date","plugin_modification_date","plugin_name","plugin_publication_date","plugin_type","potential_vulnerability","product","punct","rhsa","risk_factor","script_version","secunia","see_also","see_also{}","signature","signature_id","solution","splunk_server","synopsis","tag","tag::eventtype","timestamp","usn","vendor","vuln_publication_date","xref","xref{}","address","alias","current_state","currentDBSizeMB","dest","diff","display_name","execution_time","home","host_display_name","hostcheck_id","inode","latency","load_15_min","load_1_min","load_5_min","log","loss","maxTotalDataSizeMB","mem","mem_bytes","mem_free","mem_free_percent","mem_used","mem_used_bytes","opt","output","perfdata","pl","procs","ram_used","rta","RTA","service_display_name","servicecheck_id","size","splunk","swap","swap_bytes","swap_free","swap_free_percent","swap_used","swap_used_bytes","time","tmp","unsent","usr","var"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = | tstats count WHERE sourcetype=* earliest=-60d@d by _time host sourcetype index span=15m \
| makecontinuous _time span=15m \
| eval combo=host."-".sourcetype."-".index \
| xyseries _time combo count \
| makecontinuous _time span=15m \
| fillnull value=0 \
| untable _time combo count \
| eval HourOfDay=strftime(_time, "%H") \
| eval BucketMinuteOfHour=strftime(_time, "%M") \
| eval DayOfWeek=strftime(_time, "%A") \
| stats max(count) as avg stdev(count) as stdev by HourOfDay BucketMinuteOfHour DayOfWeek combo \
| eval lowerBound=(avg-stdev*exact(2)), upperBound=(avg+stdev*exact(2)) \
| fields lowerBound,upperBound,HourOfDay,BucketMinuteOfHour,DayOfWeek,combo \
| outputlookup state.csv

[Host Frequency]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | tstats count where index=* earliest=-60d@d latest=-15m@m latest=now  by host _indextime \
| bin _indextime span=15m \
| stats count by _indextime, host \
| stats count(host) as M by host \
| addinfo \
| eval N=round((info_max_time-info_min_time)/15/60,0)\
| eval frequency=M/N \
| fields host, frequency \
| sort - frequency | eventstats p95(frequency) as p95 p75(frequency) as p75 p50(frequency) as p50 p25(frequency) as p25\
| eval Percentile = case(frequency >= p95, "95",frequency >= p75, "75",frequency >= p50, "50", frequency >= p25, "25", 1=1, "0") | fields - p* | eval frequency=round(frequency*100,0)

[Index Frequency]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | tstats count where index=* earliest=-60d@d latest=-15m@m by index _indextime \
| bin _indextime span=15m \
| stats count by _indextime, index \
| stats count(index) as M by index \
| addinfo \
| eval N=round((info_max_time-info_min_time)/15/60,0)\
| eval frequency=M/N \
| fields index, frequency \
| sort - frequency | eventstats p95(frequency) as p95 p75(frequency) as p75 p50(frequency) as p50 p25(frequency) as p25\
| eval Percentile = case(frequency >= p95, "95",frequency >= p75, "75",frequency >= p50, "50", frequency >= p25, "25", 1=1, "0") | fields - p* | eval frequency=round(frequency*100,0)

[Sourcetype Frequency]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | tstats count where index=* earliest=-60d@d latest=-15m@m by sourcetype _indextime \
| bin _indextime span=15m \
| stats count by _indextime, sourcetype \
| stats count(sourcetype) as M by sourcetype \
| addinfo \
| eval N=round((info_max_time-info_min_time)/15/60,0)\
| eval frequency=M/N \
| fields sourcetype, frequency \
| sort - frequency | eventstats p95(frequency) as p95 p75(frequency) as p75 p50(frequency) as p50 p25(frequency) as p25\
| eval Percentile = case(frequency >= p95, "95",frequency >= p75, "75",frequency >= p50, "50", frequency >= p25, "25", 1=1, "0") | fields - p* | eval frequency=round(frequency*100,0)
